Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: This takes the references that were remote branches that started with `tag/` and makes them real (lightweight) tags.
cs: Tím se reference, které označovaly vzdálené větve a začínaly `tag/`, převedou na skutečné (prosté) značky.

source: This technique allows you to context-switch quickly and completely — because your work is separated into silos where all the changes in that branch have to do with that topic, it’s easier to see what has happened during code review and such.
cs: Tato technika umožňuje rychlé a snadné kontextové přepínání. Protože je vaše práce rozdělena do zásobníků, kde všechny změny v jedné větvi souvisí s jedním tématem, je při kontrole kódu snazší dohledat, čeho se změny týkaly apod.

source: This technique can also be very useful in creating commands that you think should exist.
cs: Tato metoda může být velmi užitečná také k vytváření příkazů, které by podle vás měly existovat.

source: This technique only works for data that’s still in your reflog, so you can’t use it to look for commits older than a few months.
cs: Tato možnost funguje pouze pro data, jež jsou dosud v záznamu reflog. Nemůžete ji proto použít pro revize starší než několik měsíců.

source: This tells Git that any file that matches this pattern (.doc) should use the "word" filter when you try to view a diff that contains changes.
cs: Systému Git tím sdělíte, že pro všechny soubory, které odpovídají této masce (.doc), by měl být při zobrazení rozdílů použít filter „word“.

source: This time, if you run `git show` on the tag, you don’t see the extra tag information.
cs: Pokud spustíte pro značku příkaz `git show` tentokrát, nezobrazí se k ní žádné další informace.

source: This tool allows you to use Git as a valid client to a Subversion server, so you can use all the local features of Git and then push to a Subversion server as if you were using Subversion locally.
cs: Tento nástroj umožňuje používat Git jako platného klienta serveru Subversion. Můžete tak využívat všech lokálních funkcí systému Git, ale revize odesílat na server Subversion, jako byste tento systém používali i lokálně.

source: This tool basically works by keeping patch sets (that is, the differences between files) from one revision to another in a special format on disk; it can then recreate what any file looked like at any point in time by adding up all the patches.
cs: Tento nástroj pracuje na tom principu, že na disku uchovává ve speciálním formátu seznam změn mezi jednotlivými verzemi. Systém později může díky porovnání těchto změn vrátit jakýkoli soubor do podoby, v níž byl v libovolném okamžiku.

source: This way, it’s easy to tweak a patch individually and leave it if it’s not working until you have time to come back to it.
cs: Snadno tak můžete záplatu individuálně opravit, a pokud není funkční, opustit ji, dokud nebudete mít čas k její opravě.

source: This way, projects don’t have to worry about adding users as collaborators to give them push access.
cs: Díky tomu se projekty nemusí starat o přidávání uživatelů do role spolupracovníků, kteří by měli právo zápisu.

source: This way, when people clone your project’s repository, they can either check out master to build the latest stable version and keep up to date on that easily, or they can check out develop, which is the more cutting-edge stuff.
cs: Pokud někdo při tomto postupu klonuje repozitář vašeho projektu, může provést buď checkout hlavní větve, aby získal nejnovější stabilní verzi a udržoval ji aktuální, nebo checkout větve develop, která může být ještě o něco napřed.

source: This way, you can export a snapshot or build and name it something understandable to people.
cs: Díky tomu lze snímek nebo sestavení (build) vyexportovat a přiřadit mu pro člověka srozumitelný název.

source: This way, you can make sure your commits are logically separate changesets and can be easily reviewed by the developers working with you.
cs: Tímto způsobem zajistíte, že budou vaše revize logicky oddělenými sadami změn, jež mohou vaši spolupracovníci snadno zkontrolovat.

source: This way, you can see the last commit easily:
cs: Tímto způsobem snadno zobrazíte poslední revizi:

source: This way, you can set up HTTP-based read access to any of your projects for a fair number of users in a few minutes.
cs: Tímto způsobem můžete během pár minut nastavit oprávnění pro čtení založené na protokolu HTTP pro větší počet uživatelů k jakémukoli svému projektu.

source: This way, you can write an import script that reads the necessary information out of the system you’re importing from and prints straightforward instructions to stdout.
cs: Tímto způsobem lze vytvořit importovací skript, který bude načítat potřebné informace ze systému, z nějž import provádíte, a vypíše jasné instrukce do výstupu stdout.

source: This will give you an idea of what is involved.
cs: Získáte tak představu, co všechno vás čeká.

source: This will transfer all of your tags to the remote server that are not already there.
cs: Tento příkaz přenese na vzdálený server všechny vaše značky, které tam ještě nejsou.

source: This workflow is attractive to a lot of people because it’s a paradigm that many are familiar and comfortable with.
cs: Tento pracovní postup může být pro mnoho lidí zajímavý, protože je to schéma, které jsou zvyklí používat a jsou s ním spokojeni.

source: This would normally cause the same branch name clutter as in a centralised VCS, plus setting up permissions for this becomes a chore for the admin.
cs: To by za normálních okolností způsobilo stejný zmatek ve jménech větví jako v centralizovaných systémech správy verzí a navíc nastavování přístupových práv by administrátorovi přidalo práci.

source: Those are only some simple output-formatting options to `git log` — there are many more.
cs: To je jen několik základních parametrů k formátování výstupu pro příkaz `git log`, celkově jich je mnohem více.

source: Throughout this book, you’ve used simple mappings from remote branches to local references; but they can be more complex.
cs: V celé této knize jsme používali jednoduché mapování ze vzdálených větví do lokálních referencí. Mapování však může být i složitější.

source: Thus if any server dies, and these systems were collaborating via it, any of the client repositories can be copied back up to the server to restore it.
cs: Pokud v takové situaci dojde ke kolapsu serveru a pokud jej tyto systémy využívaly, můžeme obsah serveru obnovit zkopírováním repozitáře od libovolného uživatele.

source: Thus it’s a bit confusing that Git has a `mv` command.
cs: Může se zdát zvláštní, že Git přesto používá příkaz `mv`.

source: Thus these three commands are equivalent:
cs: Tyto tři příkazy jsou tedy ekvivalentní:

source: Thus, I’ve made this discussion the last chapter in the book so you could read it early or later in your learning process.
cs: Proto jsem tyto úvahy shrnul do poslední kapitoly knihy, kterou si můžete přečíst v libovolné fázi seznamování se systémem Git.

source: Thus, when you clone the Git repository, you have four branches that you can check out to evaluate the project in different stages of development, depending on how cutting edge you want to be or how you want to contribute; and the maintainer has a structured workflow to help them vet new contributions.
cs: Pokud tedy klonujete repozitář Git, můžete stáhnout až čtyři větve, a hodnotit tak projekt na čtyřech různých úrovních vývoje. Záleží na vás, do jaké hloubky chcete proniknout nebo jak chcete přispívat. A správce projektu má k dispozici strukturovaný pracovní postup k evaluaci nových příspěvků.

source: Tip: If your build scripts expect to be able to run `svn info` then providing a wrapper around git will often work.
cs: Tip: Pokud vaše skripty pro sestavení projektu chtějí spouštět `svn info`, pak si často můžete vystačit s obálkou příkazu git.

source: To add a local repository to an existing Git project, you can run something like this:
cs: K přidání lokálního repozitáře do existujícího projektu Git můžete použít příkaz například v tomto tvaru:

source: To add a new remote Git repository as a shortname you can reference easily, run `git remote add [shortname] [url]`:
cs: Chcete-li přidat nový vzdálený repozitář Git a zadat zkrácený název, přes který se můžete snadno odkazovat, spusťte příkaz `git remote add [zkrácený název] [url]`:

source: To add a user called "alice", obtain her public key, name it `alice.pub`, and put it in the `keydir` directory of the clone of the `gitolite-admin` repo you just made on your workstation.
cs: Pokud chceme přidat uživatele „alice“, získáme její veřejný klíč, pojmenujeme jej `alice.pub` a umístíme jej do adresáře `keydir`. Je součástí klonu repozitáře `gitolite-admin`, který jsme právě vytvořili na pracovní stanici.

source: To allow read access to your repository over HTTP, do something like this:
cs: Chcete-li u svého repozitáře nastavit oprávnění pro čtení pomocí protokolu HTTP, proveďte následující:

source: To apply a patch generated by `format-patch`, you use `git am`.
cs: K aplikaci patche vygenerovaného příkazem `format-patch` použijte příkaz `git am`.

source: To avoid issues, you should delete the local branch (in this case, `opera`) after you merge it into trunk.
cs: Chcete-li se vyhnout možným problémům, smažte lokální větev (v našem případě `opera`) hned poté, co jste ji začlenili do kmenové větve (trunk).

source: To avoid this issue, create a branch when you work in a submodule directory with `git checkout -b work` or something equivalent.
cs: Aby ve vašem projektu k tomuto problému nedošlo, vytvořte během práce v adresáři submodulu příkazem `git checkout -b work` nebo podobným novou větev.

source: To be able to collaborate on any Git project, you need to know how to manage your remote repositories.
cs: Abyste mohli spolupracovat na projektech v systému Git, je třeba vědět, jak manipulovat se vzdálenými repozitáři (remote repositories).

source: To be clear, Git isn’t tied into any particular issue-tracking system; but because issue #53 is a focused topic that you want to work on, you’ll create a new branch in which to work.
cs: Přesněji řečeno, Git není začleněn do žádného konkrétního systému sledování chyb, ale protože je chyba č. 53 významná a chcete na ní pracovat, vytvoříte si pro ni novou větev.

source: To be efficient, if files have not changed, Git doesn’t store the file again—just a link to the previous identical file it has already stored.
cs: Pokud v souborech nebyly provedeny žádné změny, Git v zájmu zefektivnění práce neukládá znovu celý soubor, ale pouze odkaz na předchozí identický soubor, který už byl uložen.

source: To begin tracking the `README` file, you can run this:
cs: Chcete-li zahájit sledování souboru `README`, můžete zadat příkaz:

source: To begin, create a user called `git` on your server and login to this user.
cs: Začněte tím, že na serveru vytvoříte uživatele nazvaného `git` a přihlásíte se na něj.

source: To begin, she starts a new feature branch, basing it off the server’s `master` branch:
cs: Začne tím, že založí novou větev, která bude založena na větvi `master` ze serveru:

source: To begin, you should check your commit message just before each commit is recorded, so you know the server won’t reject your changes due to badly formatted commit messages.
cs: Pro začátek byste měli zkontrolovat zprávy k revizi, než tyto revize nahrajete, abyste měli jistotu, že server vaše změny neodmítne jen kvůli zprávám v nesprávném formátu.

source: To begin, you’ll change into the target directory and identify every subdirectory, each of which is a snapshot that you want to import as a commit.
cs: Na začátku přejdete do cílového adresáře a identifikujete všechny podadresáře, z nichž bude každý představovat jeden snímek, který chcete importovat jako revizi.

source: To begin, you’ll set up external wrapper scripts to run your commands.
cs: Pro začátek je třeba nastavit kvůli spouštění příkazů externí skripty wrapperu.

source: To change that default to something else, you can use the `core.editor` setting:
cs: Chcete-li změnit výchozí hodnotu, použijte nastavení `core.editor`:

source: To clone a Git repository over SSH, you can specify ssh:// URL like this:
cs: Chcete-li naklonovat repozitář Git pomocí protokolu SSH, zadejte `ssh://` URL, například:

source: To clone a repository like this or to add one as a remote to an existing project, use the path to the repository as the URL.
cs: Chcete-li takový repozitář naklonovat nebo přidat jako vzdálený repozitář do existujícího projektu, použijte jako URL cestu k repozitáři.

source: To contribute to that project, you create your own public clone of the project and push your changes to it.
cs: Chcete-li do tohoto projektu přispívat, vytvořte vlastní veřejný klon projektu a odešlete do něj změny, které jste provedli.

source: To create a branch and switch to it at the same time, you can run the `git checkout` command with the `-b` switch:
cs: Abyste vytvořili novou větev a rovnou na ni přepnuli, můžete spustit příkaz `git checkout` s přepínačem `-b`:

source: To create a branch back at the second commit, you can do this:
cs: Chcete-li vytvořit větev zpětně na druhé revizi, můžete zadat:

source: To create a commit object, you call `commit-tree` and specify a single tree SHA-1 and which commit objects, if any, directly preceded it.
cs: Pro vytvoření objektu revize zavolejte příkaz `commit-tree` a zadejte jeden SHA-1 stromu a eventuální objekty revize, které mu bezprostředně předcházely.

source: To create a lightweight tag, don’t supply the `-a`, `-s`, or `-m` option:
cs: Chcete-li vytvořit prostou značku, nezadávejte ani jeden z parametrů `-a`, `-s` nebo `-m`:

source: To create a new branch in Subversion, you run `git svn branch [branchname]`:
cs: Chcete-li vytvořit novou větev v systému Subversion, spusťte příkaz `git svn branch [název větve]`:

source: To create a new reference that will help you remember where your latest commit is, you can technically do something as simple as this:
cs: Chcete-li vytvořit novou referenci, díky níž si budete pamatovat, kde se nachází vaše poslední revize, lze to technicky provést velmi jednoduše:

source: To create an index with a single entry — the first version of your test.txt file — you can use the plumbing command `update-index`.
cs: Chcete-li vytvořit index s jediným záznamem – první verzí souboru text.txt – můžete k tomu použít nízkoúrovňový příkaz `update-index`.

source: To deal with this issue, programmers long ago developed local VCSs that had a simple database that kept all the changes to files under revision control (see Figure 1-1).
cs: Aby se uživatelé tomuto riziku vyhnuli, vyvinuli programátoři už před dlouhou dobou lokální systémy VCS s jednoduchou databází, která uchovávala všechny změny souborů s nastavenou správou revizí (viz obrázek 1-1).

source: To deal with this problem, Centralized Version Control Systems (CVCSs) were developed.
cs: Řešení tohoto problému nabízejí tzv. centralizované systémy správy verzí (CVCS z angl. Centralized Version Control System).

source: To demonstrate having multiple remote servers and what remote branches for those remote projects look like, let’s assume you have another internal Git server that is used only for development by one of your sprint teams.
cs: Abychom si mohli ukázat, jak se pracuje s několika vzdálenými servery a jak vypadají vzdálené větve takových vzdálených projektů, předpokládejme, že máte ještě další interní server Git, který při vývoji používá pouze jeden z vašich sprint teamů.

source: To demonstrate this functionality, you need a typical SVN repository that you have write access to.
cs: Abychom si mohli tuto funkci ukázat, budete potřebovat typický repozitář SVN, k němuž máte oprávnění pro zápis.

source: To demonstrate, you can use the plumbing command `hash-object`, which takes some data, stores it in your `.git` directory, and gives you back the key the data is stored as.
cs: Abychom to předvedli, můžete použít nízkoúrovňový příkaz `hash-object`, který vezme určitá data, uloží je v adresáři `.git` a vrátí vám klíč, pod nímž jsou tato data uložena.

source: To demonstrate, you’ll add a large file into your test repository, remove it in the next commit, find it, and remove it permanently from the repository.
cs: Vyzkoušíme to na situaci, kdy do svého testovacího repozitáře vložíte velký soubor, v následující revizi ho odstraníte, vyhledáte ho a trvale ho z repozitáře odstraníte.

source: To demonstrate, you’ll go into your project and start working on a couple of files and possibly stage one of the changes.
cs: Pro názornost uvažujme situaci, že ve svém projektu začnete pracovat na několika souborech a jednu z provedených změn připravíte k zapsání.

source: To determine which commits in the Git source code repository (git://git.kernel.org/pub/scm/git/git.git) have CommitDate on 2014-04-29 relative to your local timezone (as set on your computer), use
cs: Pokud chcete zjistit, které revize (commit) v repozitáři se zdrojovým kódem Git (git://git.kernel.org/pub/scm/git/git.git) mají datum zápisu (CommitDate) 2014-04-29 -- relativně k vašemu lokálnímu časovému pásmu (takovému, jaké je nastaveno na vašem počítači), použijte příkaz

source: To disable the ability to force-update remote branches to non-fast-forward references, set `receive.denyNonFastForwards`:
cs: Chcete-li vypnout možnost násilné aktualizace vzdálených větví na jiné reference než „rychle vpřed“, zadejte `receive.denyNonFastForwards`:

source: To do so, change the word pick to the word edit for each of the commits you want the script to stop after.
cs: Změňte proto slovo pick na edit pro každou z revizí, po níž má skript zastavit.

source: To do so, you can simply set the `receive.denyDeletes` and `receive.denyNonFastForwards` settings.
cs: Ve verzi 1.6 systému Git a novějších lze nastavit možnosti `receive.denyDeletes` a `receive.denyNonFastForwards`.

source: To do so, you use `filter-branch`, which you used in Chapter 6:
cs: Použijte k tomu příkaz `filter-branch`, s nímž jsme se seznámili v kapitole 6:

source: To do so, you’ll likely have to edit your `/etc/passwd` file:
cs: V takovém případě pravděpodobně budete muset upravit soubor `/etc/passwd`:

source: To do that, you must run the `git stash apply` command with a `--index` option to tell the command to try to reapply the staged changes.
cs: Chcete-li, aby se příkaz pokusil znovu aplikovat i změny připravené k zapsání, musíte zadat příkaz `git stash apply` s parametrem `--index`.

source: To do this properly, you need a small script that takes a filename, figures out the last commit date for this project, and inserts the date into the file.
cs: Ke správnému postupu budete potřebovat malý skript, který vezme název souboru, zjistí datum poslední revize v tomto projektu a vloží datum do souboru.

source: To do this, use the `--cached` option:
cs: V takovém případě použijte parametr `--cached`:

source: To do this, you can add the `commit-msg` hook.
cs: K tomuto účelu můžete použít zásuvný modul `commit-msg`.

source: To do this, you can figure out which key you want by running `gpg --list-keys`:
cs: Pomocí příkazu `gpg --list-keys` můžete určit, jaký klíč chcete:

source: To e-mail this to a mailing list, you can either paste the file into your e-mail program or send it via a command-line program.
cs: Chcete-li e-mail odeslat do poštovní konference, můžete soubor buď vložit do svého e-mailového programu, nebo ho odeslat pomocí příkazového řádku.

source: To enable a hook script, put a file in the `hooks` subdirectory of your Git directory that is named appropriately and is executable.
cs: Chcete-li aktivovat skript zásuvného modulu, vložte správně pojmenovaný a spustitelný soubor do podadresáře `hooks` adresáře Git.

source: To enforce this, you’ll write those rules to a file named `acl` that lives in your bare Git repository on the server.
cs: Základ tohoto systému bude představovat soubor `acl`, který bude uložen v adresáři repozitáře na serveru a do nějž zapíšete všechna příslušná pravidla.

source: To exit the script and reject the push, exit non-zero.
cs: Chcete-li skript ukončit a odesílaná data odmítnout, návratová hodnota musí být nenulová.

source: To find out what file it is, you’ll use the `rev-list` command, which you used briefly in Chapter 7.
cs: Chcete-li zjistit, o jaký soubor se jedná, můžete použít příkaz `rev-list`, který jsme používali už v kapitole 7.

source: To fix this, you must run `git submodule update` again:
cs: Abychom to napravili, musíme ještě jednou spustit příkaz `git submodule update`:

source: To follow along, you first need to create a new local Subversion repository:
cs: Chcete-li postupovat podle mě, budete si nejprve muset vytvořit nový lokální repozitář Subversion:

source: To fork a project, visit the project page (in this case, mojombo/chronic) and click the "fork" button in the header (see Figure 4-14).
cs: Chcete-li projekt rozštěpit, přejděte na stránku projektu (v tomto případě mojombo/chronic) a klikněte na tlačítko „fork“ v záhlaví (viz obrázek 4-14).

source: To get a diff between what you have in your `rack` subdirectory and the code in your `rack_branch` branch — to see if you need to merge them — you can’t use the normal `diff` command.
cs: Chcete-li se podívat na výpis „diff“ s rozdíly mezi tím, co máte v podadresáři `rack`, a kódem ve větvi `rack_branch` (abyste věděli, jestli je nutné je slučovat), nelze použít běžný příkaz `diff`.

source: To get a list of the author names that SVN uses, you can run this:
cs: Chcete-li získat seznam jmen autorů používaných v SVN, spusťte tento příkaz:

source: To get a reference that isn’t a fast-forward, you either have to rebase past a commit you’ve already pushed up or try pushing a different local branch up to the same remote branch.
cs: Chcete-li vyhledat reference nesměřující rychle vpřed, budete muset buď provést přeskládání po revizi, kterou jste již odeslali, nebo se do stejné vzdálené větve pokusit odeslat jinou lokální větev.

source: To get around this problem and make `git fast-import` happy, you need to tell ruby to use LF instead of CRLF:
cs: Abychom tento problém obešli a přitom učinili příkaz `git fast-import` šťastným, musíte ruby říct, aby místo LF používal CRLF:

source: To get it running without having to reboot, you can run this:
cs: Pokud nechcete počítač restartovat, spusťte tento příkaz:

source: To get the appropriate SHA for a given reference, Git checks for that reference in the `refs` directory and then checks the `packed-refs` file as a fallback.
cs: Je-li třeba získat hodnotu SHA pro konkrétní referenci, Git se tuto referenci pokusí vyhledat nejprve v adresáři `refs` a poté, jako záložní možnost, v souboru `packed-refs`.

source: To get the project, run
cs: Chcete-li si projekt naklonovat, zadejte:

source: To get the raw commit data, you can use another plumbing command called `git cat-file`.
cs: Chcete-li získat syrová data revizí, můžete použít další nízkoúrovňový příkaz: `git cat-file`.

source: To get them, you must reset your branch to where `master` is now:
cs: Chcete-li je získat, musíte vaši větev resetovat do místa, kde se nyní nachází větev `master`:

source: To give another user write access to your project, click the “Add another collaborator” link.
cs: Chcete-li k svému projektu poskytnout oprávnění pro zápis ještě dalším uživatelům, klikněte na odkaz „Add another collaborator“ (Přidat dalšího spolupracovníka).

source: To initialize a project if it isn’t already a Git project, you use
cs: K inicializaci projektu, pokud to ještě není projekt Git, použijte příkaz:
